app/controllers/comments_controller.rb

INSERT INTO `comments` (`content`, `prototype_id`, `user_id`, `created_at`, `updated_at`) VALUES ('コメントです', 8, 2, '2022-05-08 11:18:33.591781', '2022-05-08 11:18:33.591781')
---
  def create
    @comment = Comment.new(comment_params)

    if @comment.save