app/controllers/prototypes_controller.rb

INSERT INTO `prototypes` (`created_at`, `updated_at`, `title`, `catch_copy`, `concept`, `user_id`) VALUES ('2022-05-07 14:19:25.540818', '2022-05-07 14:19:25.540818', 'a', 're', 'ret', 1)
---
    def create
      Prototype.create(prototype_params)
      if Prototype.create

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 10 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 8
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 4 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
    def show
      @prototype =Prototype.find(params[:id])
      @comment = Comment.new
      @comments = @prototype.comments.includes(:user)

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 10 LIMIT 1
---
    def edit
      @prototype = Prototype.find(params[:id])

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 10 LIMIT 1
UPDATE `prototypes` SET `prototypes`.`user_id` = 2, `prototypes`.`updated_at` = '2022-05-09 08:20:39.332019' WHERE `prototypes`.`id` = 10
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 6 LIMIT 1
---
    def update
      prototype = Prototype.find(params[:id])
      if prototype.update(prototype_params)
        redirect_to  prototype_path
      else
        @prototype = Prototype.find(params[:id])

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 6 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 6
---
    def destroy
      prototype = Prototype.find(params[:id])
      prototype.destroy

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 8 LIMIT 1
---
    def move_to_index
      @prototype = Prototype.find(params[:id])